Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Imagine that we have two beans implementing the interface `org.acme.Service`. You can't inject the `org.acme.Service` directly unless your implementations declare a CDI qualifier. However, you can inject the `Instance<Service>` instead, then iterate over all implementations and choose the correct one manually. Alternatively, you can use the `@LookupIfProperty` and `@LookupUnlessProperty` annotations. `@LookupIfProperty` indicates that a bean should only be obtained if a runtime configuration property matches the provided value. `@LookupUnlessProperty`, on the other hand, indicates that a bean should only be obtained if a runtime configuration property does not match the provided value.
ja_jp: `org.acme.Service` インターフェイスを実装する 2 つの Bean があるとします。 実装で CDI 修飾子を宣言しない限り、 `org.acme.Service` を直接挿入できません。 ただし、 `インスタンス<Service>` の代わりに、すべての実装を反復処理して、正しい実装を手動で選択します。 または、 `@LookupIfProperty` アノテーションと `@LookupUnlessProperty` アノテーションを使用することもできます。 `@LookupIfProperty` は、実行時設定プロパティーが指定された値と一致する場合にのみ Bean を取得することを示します。 一方、 `@LookupUnlessProperty` は、実行時設定プロパティーが指定された値と一致しない場合にのみ Bean を取得することを示します。

source: Imagine that your application contains 50 beans that are actually not used anywhere. If they have a normal scope (e.g. `@ApplicationScoped`) and are intercepted (e.g. declare a method annotated with `@Transactional`) you can expect more than 150 generated classes. And these classes are completely useless. Still, the container would have to instantiate and hold a reference on those 50+ bean metadata classes. Needless to say, that the bean classes and any referenced classes cannot be a subject to dead code elimination when a native image is generated. Therefore, Quarkus implements an algorithm to get rid of all these classes.
ja_jp: アプリケーションに、実際にはどこにも使われていない50個のBeanが含まれているとします。それらが通常のスコープ（例： `@ApplicationScoped` ）を持ち、インターセプトされた場合（例： `@Transactional` でアノテーションされたメソッドを宣言する）、150以上のクラスが生成されることが予想されます。そして、これらのクラスは全く役に立たない。それでも、コンテナはこれらの50以上のBeanメタデータクラスをインスタンス化し、参照を保持する必要があります。言うまでもなく、ネイティブイメージを生成する際に、Beanクラスや参照されるクラスをデッドコード排除の対象とすることはできません。そこで、Quarkusでは、これらのクラスをすべて削除するアルゴリズムを実装しています。

source: Imagine the following case:
ja_jp: 次のようなケースを想像してみてください:

source: Imagine the following entity:
ja_jp: 次のようなエンティティを想像してみてください。

source: Imagine we have a `Fruit` data class as follows:
ja_jp: 以下のように `Fruit` のデータクラスがあると想像してみてください。

source: Imagine, for instance that an application contains a bean named `Tracer`, which needs to do nothing when in tests or in dev mode, but works in its normal capacity for the production artifact. An elegant way to create such beans is the following:
ja_jp: たとえば、アプリケーションに `Tracer` という名前の Bean が含まれており、テストや開発モードでは何もする必要がないが、本番アーティファクトでは通常の機能で動作する必要があるとします。そのような Bean を作成するエレガントな方法は次のとおりです。

source: Impacted servers and clients may need to listen to the `CertificateUpdatedEvent` to apply the new certificates. This is automatically done for the Quarkus HTTP server, such as the Quarkus REST server, gRPC server, and WebSocket server, as well as the management interface if it is enabled.
ja_jp: 影響を受けるサーバーとクライアントは、新しい証明書を適用するために `CertificateUpdatedEvent` をリッスンする必要がある場合があります。 これは、Quarkus REST サーバー、gRPC サーバー、WebSocket サーバーなどの Quarkus HTTP サーバー、および管理インターフェイス (有効になっている場合) に対して自動的に実行されます。

source: Impacted servers and clients might need to listen to the `CertificateUpdatedEvent` to apply the new certificates. This is automatically handled for the Quarkus HTTP, REST, gRPC, and WebSocket servers, as well as the management interface if enabled. On the client side, Quarkus REST Client automatically handles certificate update events.
ja_jp: 影響を受けるサーバーとクライアントは、新しい証明書を適用するために `CertificateUpdatedEvent` をリッスンする必要がある場合があります。これは、Quarkus HTTP、REST、gRPC、および WebSocket サーバー、ならびに有効な場合は管理インターフェイスに対して自動的に処理されます。クライアント側では、Quarkus REST Client が証明書更新イベントを自動的に処理します。

source: Imperative
ja_jp: 命令型

source: Imperative and Reactive
ja_jp: 命令型とリアクティブ

source: Imperative and Reactive: the elevator pitch
ja_jp: 命令型とリアクティブ型: エレベーターピッチ

source: Imperative and reactive code
ja_jp: 命令型コードとリアクティブ型コード

source: Imperative message processing
ja_jp: 命令型メッセージ処理

source: Imperative vs. Reactive: a question of threads
ja_jp: 命令型かリアクティブ型か: スレッドの問題だ

source: Implement OASFilter and override any of its methods
ja_jp: OASFilter を実装し、そのメソッドのいずれかをオーバーライドする

source: Implement OASFilter and override any of the methods
ja_jp: OASFilter を実装し、いずれかのメソッドをオーバーライドします。

source: Implement `QuarkusApplication` and a Java main method, and use the Java main method to launch Quarkus
ja_jp: `QuarkusApplication` とJava mainメソッドを実装し、Java mainメソッドを使用してQuarkusを起動します

source: Implement `QuarkusApplication` and have Quarkus run this method automatically
ja_jp: `QuarkusApplication` を実装し、Quarkusがこのメソッドを自動的に実行するようにします

source: Implement `org.hibernate.engine.jdbc.spi.StatementInspector`.
ja_jp: `org.hibernate.engine.jdbc.spi.StatementInspector` を実装してください。

source: Implement `org.hibernate.type.format.FormatMapper`.
ja_jp: `org.hibernate.type.format.FormatMapper` を実装します。

source: Implement `traceId` and `spanId` on the new event as follows. The `@TraceIdRelational` and `@SpanIdRelational` annotations mark these fields as relational identifiers used for association.
ja_jp: 新しいイベントに `traceId` と `spanId` を次のように実装します。`@TraceIdRelational` および `@SpanIdRelational` アノテーションは、これらのフィールドを関連付けに使用されるリレーショナル識別子としてマークします。

source: Implement an /api/admin endpoint that can only be accessed by users who have the admin role. The source code for the `/api/admin` endpoint is similar, but instead, you use a `@RolesAllowed` annotation to ensure that only users granted the `admin` role can access the endpoint. Add a Jakarta REST resource with the following `@RolesAllowed` annotation:
ja_jp: 管理者ロールを持つユーザーのみがアクセスできる /api/admin エンドポイントを実装します。 `/api/admin` エンドポイントのソースコードも同様ですが、代わりに `@RolesAllowed` アノテーションを使用して、 `admin` ロールが付与されたユーザーのみがエンドポイントにアクセスできるようにします。 次の `@RolesAllowed` アノテーションを使用して Jakarta REST リソースを追加します。

source: Implement an `/api/users/me` endpoint that can only be accessed by users who have the `user` role. Use `SecurityContext` to get access to the currently authenticated `Principal` user and to return their username, all of which is retrieved from the database.
ja_jp: `user` ロールを持つユーザーのみがアクセスできる `/api/users/me` エンドポイントを実装します。 `SecurityContext` を使用して、現在認証されている `Principal` ユーザーにアクセスし、そのユーザー名を返します。これらはすべてデータベースから取得されます。

source: Implement diverse access control strategies without modifying application code.
ja_jp: アプリケーションコードを変更せずに、多様なアクセス制御ストラテジーを実装できます。

source: Implement fire-and-forget interactions
ja_jp: ファイヤー・アンド・フォーゲット・インタラクションの実装

source: Implement methods as necessary.
ja_jp: 必要に応じてメソッドを実装する。

source: Implement methods of `org.hibernate.Interceptor` as necessary.
ja_jp: 必要に応じて `org.hibernate.Interceptor` のメソッドを実装します。

source: Implement stream processing applications based on Apache Kafka
ja_jp: Apache Kafka をベースにしたストリーム処理アプリケーションを実装する

source: Implement the HTTP endpoint
ja_jp: HTTPエンドポイントの実装

source: Implement the Panache entities and/or repositories as explained in the xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache guide].
ja_jp: xref:hibernate-orm-panache.adoc[Hibernate ORM with Panacheガイド] で説明されているように、Panacheエンティティやリポジトリを実装します。

source: Implement the Panache entities and/or repositories as explained in the xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache] guide.
ja_jp: xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache] ガイドで説明されているように、Panache エンティティおよび/またはリポジトリを実装します。

source: Implement the Panache entities and/or repositories as explained in the xref:hibernate-reactive-panache.adoc[Hibernate Reactive with Panache guide].
ja_jp: xref:hibernate-orm-panache.adoc[Hibernate ORM with Panacheガイド] で説明されているように、Panacheエンティティやリポジトリを実装します。

source: Implement the Panache entities and/or repositories as explained in the xref:hibernate-reactive-panache.adoc[Hibernate Reactive with Panache] guide.
ja_jp: Hibernate xref:hibernate-reactive-panache.adoc[Reactive with Panache] ガイドの説明に従って、Panacheエンティティやリポジトリを実装します。

source: Implement the Panache entities and/or repositories as explained in the xref:mongodb-panache.adoc[MongoDB with Panache guide].
ja_jp: xref:mongodb-panache.adoc[MongoDB with Panacheガイド] で説明されているように、Panacheエンティティやリポジトリを実装します。

source: Implement the Panache entities and/or repositories as explained in the xref:mongodb-panache.adoc[MongoDB with Panache] guide.
ja_jp: xref:mongodb-panache.adoc[MongoDB with Panache] ガイドで説明されているように、Panacheエンティティやリポジトリを実装します。

source: Implement the `/api/admin` endpoint as shown in the following example:
ja_jp: 次の例に示すように、`/api/admin` エンドポイントを実装します。

source: Implement the `/api/public` endpoint to allow all users access to the application. Add a regular Jakarta REST resource to your Java source code, as shown in the following code snippet:
ja_jp: すべてのユーザーがアプリケーションにアクセスできるように、 `/api/public` エンドポイントを実装します。 次のコードスニペットに示すように、通常の Jakarta REST リソースを Java ソースコードに追加します。

source: Implement the `/api/users/me` endpoint as shown in the following example, which is a regular Jakarta REST resource:
ja_jp: 次の例に示すように、通常の Jakarta REST リソースである `/api/users/me` エンドポイントを実装します。

source: Implement the generated service interface.
ja_jp: 生成されたサービスインターフェースを実装する。

source: Implement the methods defined in the service definition (here we have a single method).
ja_jp: サービス定義で定義されたメソッドを実装します(ここでは1つのメソッドを使用しています)。

source: Implement the optimistic locking pattern
ja_jp: 楽観的ロックパターンの実装

source: Implementing Basic authentication in Quarkus
ja_jp: QuarkusでのBasic認証の実装

source: Implementing GraphQL Services
ja_jp: GraphQLサービスの実装

source: Implementing a Service with the Mutiny API
ja_jp: Mutiny APIによるサービスの実装

source: Implementing a Service with the default gRPC API
ja_jp: デフォルトのgRPC APIでのサービス実装

source: Implementing a custom credentials provider is the only option when a vault product is not yet supported in Quarkus, or if credentials need to be retrieved from a custom store.
ja_jp: カスタムクレデンシャルプロバイダーの実装は、QuarkusでVault製品がまだサポートされていない場合や、カスタムストアからクレデンシャルを取得する必要がある場合の唯一のオプションです。

source: Implementing a custom service discovery
ja_jp: カスタムサービスディスカバリーの実装

source: Implementing a custom service selection / load-balancer
ja_jp: カスタムサービス選択/ロードバランサーの実装

source: Implementing a gRPC Service
ja_jp: gRPCサービスの実装

source: Implementing a gRPC service
ja_jp: gRPCサービスの実装

source: Implementing a gRPC service requires the gRPC classes to be generated. Place your `proto` files in `src/main/proto` and run `mvn compile`.
ja_jp: gRPC サービスを実装するには、gRPC クラスを生成する必要があります。 `proto` ファイルを `src/main/proto` に置き、 `mvn compile` を実行します。

source: Implementing a load balancer provider
ja_jp: ロードバランサー・プロバイダーの実装

source: Implementing a service
ja_jp: サービスの実装

source: Implementing a service discovery provider
ja_jp: サービスディスカバリープロバイダーの実装

source: Implementing fire and forget interactions
ja_jp: fire and forget (撃ち放し) のやりとりの実装

source: Implementing gRPC Services
ja_jp: gRPCサービスの実装

source: Implementing priming using a static block may prevent the native compilation of your application. Client initialization may start threads or open connections which are not compatible with the native compilation if the class is initialized at build time.
ja_jp: 静的ブロックを使ってプライミングを実装すると、アプリケーションのネイティブコンパイルができなくなる場合があります。ビルド時にクラスを初期化すると、クライアントの初期化でスレッドが起動したり、 ネイティブコンパイルと互換性のないコネクションが開かれたりすることがあります。

source: Implementing the Greeting feature
ja_jp: Greeting 機能の実装

source: Implementing the REST service
ja_jp: REST サービスの実装

source: Implementing the `/api/admin` endpoint
ja_jp: `/api/admin` エンドポイントの実装

source: Implementing the `/api/users/me` endpoint
ja_jp: `/api/users/me` エンドポイントの実装

source: Implicit Grant
ja_jp: インプリシット・グラント

source: Implicit grant
ja_jp: インプリシット・グラント

source: Implicit simple cache key
ja_jp: 暗黙の簡易キャッシュキー

source: Import all values from a Secret or ConfigMap
ja_jp: シークレットまたは ConfigMap からすべての値をインポートします。

source: Import in your IDE
ja_jp: IDE でインポートする

source: Import the Patternfly CSS in the React project in */webapp/src/index.js*
ja_jp: Reactプロジェクトの */webapp/index.js* にPatternflyのCSSをインポートします。

source: Import the RouterController
ja_jp: RouterController をインポートします

source: Import the Vaadin component you want to use
ja_jp: 使用する Vaadin コンポーネントをインポートします。

source: Import the `quarkus-smallrye-health-spi` library in your deployment module.
ja_jp: デプロイメントモジュールに `quarkus-smallrye-health-spi` ライブラリをインポートします。

source: Import the `quarkus-smallrye-health` extension as an **optional** dependency in your runtime module so it will not impact the size of the application if health check is not included.
ja_jp: `quarkus-smallrye-health` ヘルスチェックを *オプションの* 依存関係としてランタイムモジュールにインポートすることで、ヘルスチェックが含まれていない場合でもアプリケーションのサイズに影響を与えないようにします。

source: Import the link:{quickstarts-tree-url}/security-openid-connect-client-quickstart/config/quarkus-realm.json[realm configuration file] to create a new realm. For more details, see the Keycloak documentation about how to https://www.keycloak.org/docs/latest/server_admin/index.html#_create-realm[create a new realm].
ja_jp: 新しいレルムを作成するには、link:{quickstarts-tree-url}/security-openid-connect-client-quickstart/config/quarkus-realm.json[レルム設定ファイル] をインポートします。 https://www.keycloak.org/docs/latest/server_admin/index.html#_create-realm[新しいレルムを作成する] 方法は Keycloakのドキュメントを参照してください。

source: Import the link:{quickstarts-tree-url}/security-openid-connect-multi-tenancy-quickstart/config/default-tenant-realm.json[default-tenant-realm.json] to create the default realm.
ja_jp: link:{quickstarts-tree-url}/security-openid-connect-multi-tenancy-quickstart/config/default-tenant-realm.json[default-tenant-realm.json] をインポートして、デフォルトのレルムを作成します。

source: Import the link:{quickstarts-tree-url}/security-openid-connect-multi-tenancy-quickstart/config/tenant-a-realm.json[tenant-a-realm.json] to create the realm for the tenant `tenant-a`.
ja_jp: link:{quickstarts-tree-url}/security-openid-connect-multi-tenancy-quickstart/config/tenant-a-realm.json[tenant-a-realm.json] をインポートし、テナント `tenant-a` のレルムを作成します。

source: Import the link:{quickstarts-tree-url}/security-openid-connect-quickstart/config/quarkus-realm.json[realm configuration file] from the upstream community repository to create a new realm.
ja_jp: 新しいレルムを作成するには、アップストリームコミュニティーリポジトリーから link:{quickstarts-tree-url}/security-openid-connect-quickstart/config/quarkus-realm.json[レルム設定ファイル] をインポートします。

source: Import the localization helpers
ja_jp: ローカライゼーションヘルパーのインポート

source: Import the supported {openshift} image by entering the following command:
ja_jp: 次のコマンドを入力して、サポートされている {openshift} イメージをインポートします：

source: Import the supported {openshift} image.
ja_jp: サポートされている {openshift} イメージをインポートします。

source: Import the {quickstarts-tree-url}/security-keycloak-authorization-quickstart/config/quarkus-realm.json[realm configuration file] to create a new realm. For more details, see the Keycloak documentation about how to https://www.keycloak.org/docs/latest/server_admin/index.html#_create-realm[create a new realm].
ja_jp: {quickstarts-tree-url}/security-keycloak-authorization-quickstart/config/quarkus-realm.json[realm設定ファイル]をインポートして、新しいrealmを作成します。詳細については、 link:https://www.keycloak.org/docs/latest/server_admin/index.html#_create-realm[新しいレルムを作成する] 方法についてのKeycloakのドキュメントを参照してください。

source: Import the {quickstarts-tree-url}/security-openid-connect-client-quickstart/config/quarkus-realm.json[realm configuration file] to create a new realm. For more details, see the Keycloak documentation about how to https://www.keycloak.org/docs/latest/server_admin/index.html#_create-realm[create a new realm].
ja_jp: 新しいレルムを作成するには、 {quickstarts-tree-url}/security-openid-connect-client-quickstart/config/quarkus-realm.json[レルム設定ファイル] をインポートします。 link:https://www.keycloak.org/docs/latest/server_admin/index.html#_create-realm[新しいレルムを作成する] 方法について詳しくはKeycloakのドキュメントを参照してください。

source: Import the {quickstarts-tree-url}/security-openid-connect-multi-tenancy-quickstart/config/default-tenant-realm.json[default-tenant-realm.json] to create the default realm
ja_jp: {quickstarts-tree-url}/security-openid-connect-multi-tenancy-quickstart/config/default-tenant-realm.json[default-tenant-realm.json] をインポートし、デフォルトのレルムを作成します。

source: Import the {quickstarts-tree-url}/security-openid-connect-multi-tenancy-quickstart/config/tenant-a-realm.json[tenant-a-realm.json] to create the realm for the tenant `tenant-a`.
ja_jp: {quickstarts-tree-url}/security-openid-connect-multi-tenancy-quickstart/config/tenant-a-realm.json[tenant-a-realm.json] をインポートし、テナント `tenant-a` のレルムを作成します。

source: Import the {quickstarts-tree-url}/security-openid-connect-quickstart/config/quarkus-realm.json[realm configuration file] to create a new realm. For more details, see the Keycloak documentation about how to https://www.keycloak.org/docs/latest/server_admin/index.html#_create-realm[create a new realm].
ja_jp: 新しいレルムを作成するには、{quickstarts-tree-url}/security-openid-connect-quickstart/config/quarkus-realm.json[realm設定ファイル]をインポートします。 link:https://www.keycloak.org/docs/latest/server_admin/index.html#_create-realm[新しいレルムを作成する] 方法について詳しくはKeycloakのドキュメントを参照してください。

source: Import the {quickstarts-tree-url}/security-openid-connect-web-authentication-quickstart/config/quarkus-realm.json[realm configuration file] to create a new realm. For more details, see the Keycloak documentation about how to https://www.keycloak.org/docs/latest/server_admin/index.html#_create-realm[create a new realm].
ja_jp: 新しいレルムを作成するには、{quickstarts-tree-url}/security-openid-connect-web-authentication-quickstart/config/quarkus-realm.json[realm構成ファイル]をインポートします。詳細については、 link:https://www.keycloak.org/docs/latest/server_admin/index.html#_create-realm[新しいレルムの作成] 方法についてのKeycloakのドキュメントを参照してください。

source: Import things to be aware of
ja_jp: 留意すべきインポート

source: Import those CSV files into a Neo4j graph database.
ja_jp: それらのCSVファイルをNeo4jグラフデータベースにインポート

source: Import web libraries
ja_jp: Web ライブラリーをインポートする

source: Import your own files, this can be done by adding `quarkus.web-dependency-locator.import-mappings.app/ = /app/` to the config. Any key-value pair can be added.
ja_jp: 独自のファイルをインポートするには、 `quarkus.web-dependency-locator.import-mappings.app/ = /app/` を設定に追加します。任意のキーと値のペアを追加できます。

source: Important Gradle configuration points
ja_jp: 重要なGradle設定ポイント

source: Important Maven configuration points
ja_jp: 重要なMavenの設定ポイント

source: Important Technical Note
ja_jp: 重要なテクニカルノート

source: Important point: we need a transactional context for these methods.
ja_jp: 重要なポイント：これらのメソッドには、トランザクションコンテキストが必要です。

source: Important point: we need a transactional context for this method.
ja_jp: 重要なポイント: これらのメソッドには、トランザクションコンテキストが必要です。

source: Importing the `smallrye-health` extension directly exposes three REST endpoints:
ja_jp: `smallrye-health` エクステンションを直接インポートすると、3つのRESTエンドポイントが公開されます:

source: Importing the extension, and configuration
ja_jp: エクステンションのインポートと設定

source: Importing the realm configuration
ja_jp: レルム設定のインポート

source: Importing this module will allow HTTP message bodies to be read from XML and serialised to XML, for <<resource-types,all the types not already registered with a more specific serialisation>>.
ja_jp: <<resource-types,all the types not already registered with a more specific serialisation>> の場合、このモジュールをインポートすると、HTTP メッセージ本文を XML から読み取って XML にシリアライズできます。

source: Importing this module will allow HTTP message bodies to be read from XML and serialised to XML, for xref:resource-types[all the types not already registered with a more specific serialisation].
ja_jp: このモジュールをインポートすると、 xref:resource-types[より厳密にシリアライズで登録されていないすべての型について] HTTPメッセージボディをXMLから読み込んでXMLにシリアライズできるようになります。

source: Importing this module will allow injecting web links into the response HTTP headers by just annotating your endpoint resources with the `@InjectRestLinks` annotation. To declare the web links that will be returned, you must use the `@RestLink` annotation in the linked methods. Assuming a `Record` looks like:
ja_jp: このモジュールをインポートすると、エンドポイントのリソースに `@InjectRestLinks` アノテーションを付与するだけで、HTTP レスポンスヘッダーに Web リンクを挿入できるようになります。 返される Web リンクを宣言するには、リンク先となるメソッドに `@RestLink` アノテーションを使用する必要があります。 `Record` の場合は以下のようになります。

source: Importing this module will allow injecting web links into the response HTTP headers by just annotating your endpoint resources with the `@InjectRestLinks` annotation. To declare the web links that will be returned, you need to use the `@RestLink` annotation in the linked methods. An example of this could look like:
ja_jp: このモジュールをインポートすると、エンドポイントリソースに `@InjectRestLinks` アノテーションを付けるだけで、レスポンスの HTTP ヘッダに Web リンクを挿入することができるようになります。返される Web リンクを宣言するには、リンクされたメソッドで `@RestLink` アノテーションを使用する必要があります。この例としては、以下のようなものがあります。

source: Improve LLM accuracy with RAG, leveraging enterprise data. Quarkus handles RAG's entire process, including data ingestion, query execution, embedding, context retrieval, and LLM communication.
ja_jp: エンタープライズデータを活用したRAGにより、LLMの精度を向上させます。Quarkusは、データ取り込み、クエリ実行、埋め込み、コンテキスト取得、LLM通信を含むRAGのプロセス全体を処理します。

source: Improve and expedite the inner loop development process with live coding where code changes are automatically reflected in your running application. code -> refresh browser -> repeat
ja_jp: コードの変更が実行中のアプリケーションに自動的に反映されるライブコーディングにより、インナーループの開発プロセスを改善し、迅速化します。 コード → ブラウザ更新 → 繰り返し

source: Improve documentation
ja_jp: ドキュメントの改善

source: Improve productivity with quality development tools (e.g. IDE).
ja_jp: 高品質な開発ツール（IDEなど）による生産性の向上

source: Improve usability
ja_jp: ユーザビリティの向上

source: Improved Kotlin support for Hibernate Reactive with Panache
ja_jp: Hibernate Reactive with PanacheのKotlinサポートの改善

source: Improved Micrometer support
ja_jp: Micrometer対応の改善

source: Improved features
ja_jp: 改善された機能

source: Improved {#insert} and {#include} support
ja_jp: insert}と{#include}のサポートの改善

source: In */webapp/package.json* add a prod build phase:
ja_jp: *webapp/package.json* にprodのビルドフェーズを追加:

source: In *batch* mode, your application can receive all the records returned by the consumer *poll* in one go.
ja_jp: *バッチ* モードでは、アプリケーションは、コンシューマー *ポーリング* から返されたすべてのレコードを一度に受信できます。

source: In *dev* mode, if you do not explicitly configure the issuer using the `mp.jwt.verify.issuer` property, the {extension-name} extension will set a default issuer of `https://quarkus.io/issuer`.
ja_jp: *開発モード* では、`mp.jwt.verify.issuer` プロパティーを使用して発行者を明示的に設定しない場合、{extension-name} エクステンションは、デフォルトの発行者として `https://quarkus.io/issuer` を設定します。

source: In /webapp/src create a new folder called *components*, inside create a file called *particles.js* and generate a Patternfly table by looping over a list of particle objects:
ja_jp: webapp/srcに *components* という新しいフォルダを作り、その中に *particles.js* というファイルを作り、パーティクルオブジェクトのリストをループさせてPatternflyのテーブルを生成します。

source: In 2017, the technical team’s first attempt at exposing an API was using Node.js + Express. As the request volume and number of distribution variants rose, the team found that the response times were getting slower, not only due to the volume, but also due to architectural choices made early on. In particular, the application’s monolithic architecture, where the frontend and backend were in the same app, would cause apparent slowness in the frontend, while the backend processed concurrent requests. In addition, lack of pagination in the API meant that requests could return huge results, even when only the first few elements of the result were needed.
ja_jp: 2017年、技術チームがAPIを公開する最初の試みは、Node.js + Expressを使ったものでした。リクエスト量や配信バリエーションの数が増えるにつれ、チームはレスポンスタイムが遅くなっていることに気づきましたが、これは量の問題だけではなく、初期に行ったアーキテクチャの選択が原因でした。特に、フロントエンドとバックエンドが同じアプリ内にあるモノリシックアーキテクチャでは、バックエンドが同時リクエストを処理している間、フロントエンドが明らかに遅くなっていました。また、APIにページネーションがないため、結果の最初の数要素だけが必要な場合でも、リクエストが巨大な結果を返すことがありました。

source: In 3.35, we are going to enable reflection-free Jackson serializers by default.
ja_jp: Quarkus 3.35 では、リフレクションなしの Jackson シリアライザーをデフォルトで有効にする予定です。
